contracts/sll/clinicalprocess/healthcond/actoutcome/schemas/interactions/GetClinicalChemistryLabOrderOutcomeInteraction/GetClinicalChemistryLabOrderOutcomeInteraction_1.0_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Stockholms Läns Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->    
<wsdl:definitions name='GetClinicalChemistryLabOrderOutcomeInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:tjsr='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcomeResponder:1' xmlns:tjsi='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcomeInitiator:1' xmlns:tns='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcome:1:rivtabp21' targetNamespace='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcome:1:rivtabp21' xmlns:itr='urn:riv:itintegration:registry:1'>
<!--  <xs:annotation>
    <xs:documentation>
       Tjänsteinteraktionens namn: GetClinicalChemistryLabOrderOutcomeInteraction
       Beskrivning: 
         Begäran om labbsvar från journal
       Revisioner: 
       Tjänstedomän: clinicalprocess:healthcond:actoutcome
       Tjänsteinteraktionstyp: Fråga-Svar
       WS-profil: RIVTABP21
       Förvaltas av: Stockholms Läns Landsting
       </xs:documentation>
  </xs:annotation>-->
  <wsdl:types>
    <xs:schema targetNamespace='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcome:1:rivtabp21'>
      <xs:import schemaLocation='GetClinicalChemistryLabOrderOutcomeResponder_1.0.xsd' namespace='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcomeResponder:1' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='GetClinicalChemistryLabOrderOutcomeRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
      <wsdl:documentation>Logical address description</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:GetClinicalChemistryLabOrderOutcome' />
  </wsdl:message>
  <wsdl:message name='GetClinicalChemistryLabOrderOutcomeResponse'>
    <wsdl:part name='parameters' element='tjsr:GetClinicalChemistryLabOrderOutcomeResponse' />
  </wsdl:message>
  <wsdl:portType name='GetClinicalChemistryLabOrderOutcomeResponderInterface'>
    <wsdl:operation name='GetClinicalChemistryLabOrderOutcome'>
      <wsdl:input message='tns:GetClinicalChemistryLabOrderOutcomeRequest' />
      <wsdl:output message='tns:GetClinicalChemistryLabOrderOutcomeResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='GetClinicalChemistryLabOrderOutcomeResponderBinding' type='tns:GetClinicalChemistryLabOrderOutcomeResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='GetClinicalChemistryLabOrderOutcome'>
      <soap:operation soapAction='urn:sll:clinicalprocess:healthcond:actoutcome:GetClinicalChemistryLabOrderOutcomeResponder:1:GetClinicalChemistryLabOrderOutcome' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:GetClinicalChemistryLabOrderOutcomeRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='GetClinicalChemistryLabOrderOutcomeResponderService'>
    <wsdl:port name='GetClinicalChemistryLabOrderOutcomeResponderPort' binding='tns:GetClinicalChemistryLabOrderOutcomeResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>